app/Controllers/AdminController.php

SELECT *
FROM `solde_operateur`
---
    public function dashboard(): string
    {
        $this->ensureLoggedIn();

        $gains = $this->historiqueModel->totalGainsParType();
        $gainsParOperateur = $this->historiqueModel->totalGainsParOperateur();
        $totalGeneral = array_sum(array_column($gains, 'total_frais')) + array_sum(array_column($gains, 'total_commission'));
        $totalFrais = array_sum(array_column($gains, 'total_frais'));
        $totalCommission = array_sum(array_column($gains, 'total_commission'));
        $soldesOperateurs = $this->soldeOperateurModel->findAll();

SELECT *
FROM `utilisateur`
---
    public function clients(): string
    {
        $this->ensureLoggedIn();

        $clients = $this->utilisateurModel->findAll();

SELECT *
FROM `type_operation`
---
    public function tranches(): string
    {
        $this->ensureLoggedIn();

        $types = $this->typeOperationModel->findAll();