app/Controllers/ClientController.php

    public function operation(): string
    {
        $this->ensureLoggedIn();

        $types  = $this->typeOperationModel->findAll();
---
SELECT *
FROM `type_operation`