app/Models/AdminModel.php

SELECT *
FROM `admin`
WHERE `code_acces` = 'admin123'
 LIMIT 1
---
    public function findByCode(string $code)
    {
        return $this->where('code_acces', $code)->first();