app/Models/CommissionInterOperateurModel.php

SELECT *
FROM `commission_inter_operateur`
WHERE `operateur` = 'airtel'
 LIMIT 1
---
    public function getByOperateur(string $operateur)
    {
        return $this->where('operateur', $operateur)->first();