app/Models/HistoriqueModel.php

    public function historiqueClient(int $idUtilisateur)
    {
        return $this->select('historique_client.*, type_operation.libelle as type_libelle')
                    ->join('type_operation', 'type_operation.id_type_operation = historique_client.id_type_operation')
                    ->where('id_utilisateur', $idUtilisateur)
                    ->orderBy('date_operation', 'DESC')
                    ->findAll();
---
SELECT `historique_client`.*, `type_operation`.`libelle` as `type_libelle`
FROM `historique_client`
JOIN `type_operation` ON `type_operation`.`id_type_operation` = `historique_client`.`id_type_operation`
WHERE `id_utilisateur` = 1
ORDER BY `date_operation` DESC