app/Models/PrefixeModel.php

SELECT *
FROM `prefixe`
WHERE `code` = '031'
 LIMIT 1
---
    public function isValid(string $telephone): bool
    {
        $prefixe = substr($telephone, 0, 3);
        return (bool) $this->where('code', $prefixe)->first();

SELECT *
FROM `prefixe`
WHERE `code` = '031'
 LIMIT 1
---
    public function getOperateurByTelephone(string $telephone): ?string
    {
        $prefixe = substr($telephone, 0, 3);
        $row = $this->where('code', $prefixe)->first();