app/Models/TrancheMontantModel.php

    public function listByType(int $idTypeOperation)
    {
        return $this->where('id_type_operation', $idTypeOperation)
                     ->orderBy('montant_min', 'ASC')
                     ->findAll();
---
SELECT *
FROM `tranche_montant`
WHERE `id_type_operation` = 1
ORDER BY `montant_min` ASC