app/Models/UtilisateurModel.php

    public function findByTelephone(string $telephone)
    {
        return $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `utilisateur`
WHERE `telephone` = '0311234567'
 LIMIT 1